In [2]:
import pandas as pd

In [4]:
pd

In [5]:
pd.Series?

In [6]:
s = pd.Series([1, 2, 3, 4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [10]:
df = pd.DataFrame([['sam', 3], ['tim', 5]], columns=['name', 'age'])
#df[0][0]
df
df['name'].str.upper()

0    SAM
1    TIM
Name: name, dtype: object

In [12]:
s = pd.Series([1, 2, 3, 4])
s.dtype

dtype('int64')

In [14]:
s.values

array([1, 2, 3, 4], dtype=int64)

In [17]:
s = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
s
s['a']
s[0]

1

In [19]:
chars = {chr(item): item for item in range(65, 72)}
print(chars)
s = pd.Series(chars)

{'A': 65, 'B': 66, 'C': 67, 'D': 68, 'E': 69, 'F': 70, 'G': 71}

In [22]:
s[+1]

66

In [25]:
# dataframes

pd.DataFrame?

In [32]:
df2 = pd.DataFrame([1, 2, 3, 4])

In [33]:
df2.ndim

2

In [34]:
df2.shape

(4, 1)

In [35]:
df2.shape

(4, 1)

In [37]:

content = [['sam', 2], ['pat', 9]]
pd.DataFrame(content)

     0  1
0  sam  2
1  pat  9

In [38]:
pd.DataFrame(content, columns=['name', 'age'], index=['clerk', 'manager'])

        name  age
clerk    sam    2
manager  pat    9

In [41]:
content = [['sam', 2], ['pat', 9]]
data = [{item[0]: item[1]} for item in content]
print(data)
pd.DataFrame(data)

[{'sam': 2}, {'pat': 9}]

   pat  sam
0  NaN  2.0
1  9.0  NaN

In [58]:
data_set=dict(
    alpha=pd.Series([1,2,3], index=['r1', 'r2', 'r3']),
    beta=pd.Series([2,2,3], index=['r1', 'r4', 'r3'])
)

df = pd.DataFrame(data_set)

df['charlie'] = pd.Series([2,2,3], index=['r1', 'r4', 'r3'])
df
print(df['beta'] + df['charlie'])

r1    4.0
r2    NaN
r3    6.0
r4    4.0
dtype: float64

In [50]:
df.describe()

       alpha      beta
count    3.0  3.000000
mean     2.0  2.333333
std      1.0  0.577350
min      1.0  2.000000
25%      1.5  2.000000
50%      2.0  2.000000
75%      2.5  2.500000
max      3.0  3.000000

In [54]:
df['alpha']

r1    1.0
r2    2.0
r3    3.0
r4    NaN
Name: alpha, dtype: float64

In [ ]:
df.pop('alpha')

In [61]:
df.loc['r1']

alpha      1.0
beta       2.0
charlie    2.0
Name: r1, dtype: float64

In [63]:
df.iloc[0]

alpha      1.0
beta       2.0
charlie    2.0
Name: r1, dtype: float64

In [65]:
df.iloc[:2]

    alpha  beta  charlie
r1    1.0   2.0      2.0
r2    2.0   NaN      NaN

In [69]:
df.append(pd.DataFrame([[4,5,6]], columns=['alpha', 'beta', 'charlie'])) #add row to data frame'

ValueError: Shape of passed values is (1, 3), indices imply (3, 3)

In [72]:
df.drop('r1')

    alpha  beta  charlie
r2    2.0   NaN      NaN
r3    3.0   3.0      3.0
r4    NaN   2.0      2.0

In [73]:
df.describe()

       alpha      beta   charlie
count    3.0  3.000000  3.000000
mean     2.0  2.333333  2.333333
std      1.0  0.577350  0.577350
min      1.0  2.000000  2.000000
25%      1.5  2.000000  2.000000
50%      2.0  2.000000  2.000000
75%      2.5  2.500000  2.500000
max      3.0  3.000000  3.000000

In [75]:
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

#Create a DataFrame
df = pd.DataFrame(d)
print("Our data series is:")
df

Our data series is:

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

In [77]:
df.head()

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20

In [78]:
df.tail()

    Name  Age  Rating
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

In [80]:
df.values

array([['Tom', 25, 4.23],
       ['James', 26, 3.24],
       ['Ricky', 25, 3.98],
       ['Vin', 23, 2.56],
       ['Steve', 30, 3.2],
       ['Smith', 29, 4.6],
       ['Jack', 23, 3.8]], dtype=object)

In [84]:
type(df.values)

numpy.ndarray

In [86]:
df.empty

False

In [87]:
df.size

21

In [89]:
df.T

           0      1      2     3      4      5     6
Name     Tom  James  Ricky   Vin  Steve  Smith  Jack
Age       25     26     25    23     30     29    23
Rating  4.23   3.24   3.98  2.56    3.2    4.6   3.8

In [93]:
for item in df.items():
    print(item)
    print()

('Name', 0      Tom
1    James
2    Ricky
3      Vin
4    Steve
5    Smith
6     Jack
Name: Name, dtype: object)

('Age', 0    25
1    26
2    25
3    23
4    30
5    29
6    23
Name: Age, dtype: int64)

('Rating', 0    4.23
1    3.24
2    3.98
3    2.56
4    3.20
5    4.60
6    3.80
Name: Rating, dtype: float64)

In [98]:
df.sum(axis=1)

0    29.23
1    29.24
2    28.98
3    25.56
4    33.20
5    33.60
6    26.80
dtype: float64

In [100]:
df.sum(axis=0)

Name      TomJamesRickyVinSteveSmithJack
Age                                  181
Rating                             25.61
dtype: object

In [101]:
df.mean()

Name       0.571429
Age       25.857143
Rating     3.658571
dtype: float64

In [102]:
df.std()

Age       2.734262
Rating    0.698628
dtype: float64

In [104]:
df.describe()

             Age    Rating
count   7.000000  7.000000
mean   25.857143  3.658571
std     2.734262  0.698628
min    23.000000  2.560000
25%    24.000000  3.220000
50%    25.000000  3.800000
75%    27.500000  4.105000
max    30.000000  4.600000

In [107]:
df.mode()

    Name   Age  Rating
0   Jack  23.0    2.56
1  James  25.0    3.20
2  Ricky   NaN    3.24
3  Smith   NaN    3.80
4  Steve   NaN    3.98
5    Tom   NaN    4.23
6    Vin   NaN    4.60

In [109]:
df.median()

Age       25.0
Rating     3.8
dtype: float64

In [111]:
df.min()

Name      Jack
Age         23
Rating    2.56
dtype: object

In [112]:
df.max()

Name      Vin
Age        30
Rating    4.6
dtype: object

In [114]:
# Reindexing changes the row labels and column labels of a DataFrame.

import pandas as pd
import numpy as np

N=20

df = pd.DataFrame({
   'A': pd.date_range(start='2018-12-9',periods=N,freq='D'),
   'x': np.linspace(0,stop=N-1,num=N),
   'y': np.random.rand(N),
   'C': np.random.choice(['Low','Medium','High'],N).tolist(),
   'D': np.random.normal(100, 10, size=(N)).tolist()
})

df

            A     x         y       C           D
0  2018-12-09   0.0  0.648091  Medium  122.182900
1  2018-12-10   1.0  0.612403    High  102.286518
2  2018-12-11   2.0  0.703887     Low   98.073300
3  2018-12-12   3.0  0.001610    High   99.252535
4  2018-12-13   4.0  0.265069  Medium   96.249935
5  2018-12-14   5.0  0.606885     Low  112.555953
6  2018-12-15   6.0  0.871733    High   92.635106
7  2018-12-16   7.0  0.305269    High  102.549135
8  2018-12-17   8.0  0.434548  Medium  105.423901
9  2018-12-18   9.0  0.952916    High   77.599470
10 2018-12-19  10.0  0.709757    High  102.003734
11 2018-12-20  11.0  0.719395    High  109.671178
12 2018-12-21  12.0  0.804831    High  106.247528
13 2018-12-22  13.0  0.744110     Low  119.605939
14 2018-12-23  14.0  0.855631     Low  105.139897
15 2018-12-24  15.0  0.488245  Medium  118.251944
16 2018-12-25  16.0  0.538051     Low   96.330446
17 2018-12-26  17.0  0.781806  Medium  104.036646
18 2018-12-27  18.0  0.938387    High  101.119682
19 2018-12-28  19.0  0.035190  Medium  107.294874

In [117]:
np.random.normal(1, 1, size=(N)).tolist()

[1.3414222993221894,
 0.5232469815720887,
 1.727962794606631,
 1.528655195366727,
 0.9721975527208131,
 0.6489870213498341,
 2.27391729523167,
 0.9673835795030266,
 2.979129548927288,
 1.3853676847523002,
 0.6625122270273551,
 0.4050971401730875,
 1.3376861266555273,
 1.1701412549251402,
 1.7346585722559658,
 1.6674554091785567,
 1.0876884079278746,
 -0.19575186646712983,
 2.0503328660243962,
 -0.9968686275754819]

In [118]:
np.random.normal?

In [120]:
#sorting

import pandas as pd
import numpy as np

unsorted_df=pd.DataFrame(np.random.randn(10,2),index=[1,4,6,2,3,5,9,8,0,7],
                         columns=['col2','col1'])
unsorted_df

       col2      col1
1  0.959735 -0.618419
4  1.142717 -0.422107
6  0.155293 -0.881783
2  1.883755 -1.445542
3 -0.293148  1.257368
5  0.194646 -0.349758
9  0.497470  0.142049
8  0.451899 -0.813785
0  0.090818  0.535698
7 -0.369515  0.292335